Insert時、空の項目が含まれる場合は、カラム名をすべて指定する
int型に空を設定する場合は、NULLを指定する

like検索時、特殊文字は \　でエスケープする
　例）_が含まれるレコード検索
　   select * from product where name like '%_%';

テーブル結合する際、それぞれのテーブルに同じカラムが存在する場合は
テーブル名.カラム名で指定する

select * from product where grp_name IN ('周辺機器','ネットワーク機器');
select * from product where grp_name NOT IN ('周辺機器','ネットワーク機器');

select * from product where siire_price Is NULL;

# テーブル結合
select syori_date, p.product_id, p.name from sales s inner join product p on s.product_id = p.product_id;
select syori_date, p.product_id, p.name from sales s, product p where s.product_id = p.product_id;

# 外部結合
select * from sales s inner join product p on s.product_id = p.product_id;
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| slip_no | line_no | syori_date | product_id | person_id | customer_id | quantity | product_id | name                              | grp_name                 | siire_price | oroshi_price |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| 1       | 1       | 2006-04-06 | 1          | 1         | 2           |        3 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 1       | 2       | 2006-04-06 | 4          | 1         | 2           |        3 | 4          | 19型_ディスプレイ                 | 周辺機器                 |       80000 |        95000 |
| 10      | 1       | 2006-06-02 | 5          | 2         | 1           |        1 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
| 11      | 1       | 2006-06-06 | 2          | 3         | 3           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 11      | 2       | 2006-06-06 | 10         | 3         | 3           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 12      | 1       | 2006-06-12 | 2          | 6         | 2           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 1       | 2006-06-15 | 9          | 7         | 5           |        5 | 9          | HUB                               | ネットワーク機器         |        5000 |         7000 |
| 13      | 2       | 2006-06-15 | 2          | 7         | 5           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 3       | 2006-06-15 | 10         | 7         | 5           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 2       | 1       | 2006-04-12 | 1          | 2         | 1           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 3       | 1       | 2006-04-18 | 1          | 2         | 2           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 4       | 1       | 2006-04-26 | 2          | 3         | 4           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 4       | 2       | 2006-04-26 | 7          | 3         | 4           |        1 | 7          | プリンタ                          | 周辺機器                 |       20000 |        25000 |
| 4       | 3       | 2006-04-26 | 8          | 3         | 4           |        1 | 8          | スキャナ                          | 周辺機器                 |       25000 |        30000 |
| 5       | 1       | 2006-05-08 | 3          | 6         | 1           |        3 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 6       | 1       | 2006-05-12 | 1          | 2         | 5           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 6       | 2       | 2006-05-12 | 3          | 2         | 5           |        2 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 8       | 1       | 2006-05-22 | 2          | 6         | 1           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 9       | 1       | 2006-05-25 | 5          | 8         | 2           |        5 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+

select * from sales s left join product p on s.product_id = p.product_id;
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| slip_no | line_no | syori_date | product_id | person_id | customer_id | quantity | product_id | name                              | grp_name                 | siire_price | oroshi_price |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| 1       | 1       | 2006-04-06 | 1          | 1         | 2           |        3 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 1       | 2       | 2006-04-06 | 4          | 1         | 2           |        3 | 4          | 19型_ディスプレイ                 | 周辺機器                 |       80000 |        95000 |
| 10      | 1       | 2006-06-02 | 5          | 2         | 1           |        1 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
| 11      | 1       | 2006-06-06 | 2          | 3         | 3           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 11      | 2       | 2006-06-06 | 10         | 3         | 3           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 12      | 1       | 2006-06-12 | 2          | 6         | 2           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 1       | 2006-06-15 | 9          | 7         | 5           |        5 | 9          | HUB                               | ネットワーク機器         |        5000 |         7000 |
| 13      | 2       | 2006-06-15 | 2          | 7         | 5           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 3       | 2006-06-15 | 10         | 7         | 5           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 2       | 1       | 2006-04-12 | 1          | 2         | 1           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 3       | 1       | 2006-04-18 | 1          | 2         | 2           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 4       | 1       | 2006-04-26 | 2          | 3         | 4           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 4       | 2       | 2006-04-26 | 7          | 3         | 4           |        1 | 7          | プリンタ                          | 周辺機器                 |       20000 |        25000 |
| 4       | 3       | 2006-04-26 | 8          | 3         | 4           |        1 | 8          | スキャナ                          | 周辺機器                 |       25000 |        30000 |
| 5       | 1       | 2006-05-08 | 3          | 6         | 1           |        3 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 6       | 1       | 2006-05-12 | 1          | 2         | 5           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 6       | 2       | 2006-05-12 | 3          | 2         | 5           |        2 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 7       | 1       | 2006-05-19 | 23         | 5         | 4           |        1 | NULL       | NULL                              | NULL                     |        NULL |         NULL |
| 8       | 1       | 2006-05-22 | 2          | 6         | 1           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 9       | 1       | 2006-05-25 | 5          | 8         | 2           |        5 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+

select * from sales s right join product p on s.product_id = p.product_id;
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| slip_no | line_no | syori_date | product_id | person_id | customer_id | quantity | product_id | name                              | grp_name                 | siire_price | oroshi_price |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+
| 1       | 1       | 2006-04-06 | 1          | 1         | 2           |        3 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 1       | 2       | 2006-04-06 | 4          | 1         | 2           |        3 | 4          | 19型_ディスプレイ                 | 周辺機器                 |       80000 |        95000 |
| 10      | 1       | 2006-06-02 | 5          | 2         | 1           |        1 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
| 11      | 1       | 2006-06-06 | 2          | 3         | 3           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 11      | 2       | 2006-06-06 | 10         | 3         | 3           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 12      | 1       | 2006-06-12 | 2          | 6         | 2           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 1       | 2006-06-15 | 9          | 7         | 5           |        5 | 9          | HUB                               | ネットワーク機器         |        5000 |         7000 |
| 13      | 2       | 2006-06-15 | 2          | 7         | 5           |        2 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 13      | 3       | 2006-06-15 | 10         | 7         | 5           |        1 | 10         | ターミナルプラグ                  | ネットワーク機器         |       15000 |        20000 |
| 2       | 1       | 2006-04-12 | 1          | 2         | 1           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 3       | 1       | 2006-04-18 | 1          | 2         | 2           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 4       | 1       | 2006-04-26 | 2          | 3         | 4           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 4       | 2       | 2006-04-26 | 7          | 3         | 4           |        1 | 7          | プリンタ                          | 周辺機器                 |       20000 |        25000 |
| 4       | 3       | 2006-04-26 | 8          | 3         | 4           |        1 | 8          | スキャナ                          | 周辺機器                 |       25000 |        30000 |
| 5       | 1       | 2006-05-08 | 3          | 6         | 1           |        3 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 6       | 1       | 2006-05-12 | 1          | 2         | 5           |        1 | 1          | デスクトップ型パソコン            | パソコン本体             |      150000 |       180000 |
| 6       | 2       | 2006-05-12 | 3          | 2         | 5           |        2 | 3          | 17型_ディスプレイ                 | 周辺機器                 |       40000 |        50000 |
| 8       | 1       | 2006-05-22 | 2          | 6         | 1           |        1 | 2          | ノート型パソコン                  | パソコン本体             |      230000 |       270000 |
| 9       | 1       | 2006-05-25 | 5          | 8         | 2           |        5 | 5          | 15型_液晶ディスプレイ             | 周辺機器                 |      100000 |       120000 |
| NULL    | NULL    | NULL       | NULL       | NULL      | NULL        |     NULL | 6          | デジタルカメラ                    | 周辺機器                 |        NULL |         NULL |
+---------+---------+------------+------------+-----------+-------------+----------+------------+-----------------------------------+--------------------------+-------------+--------------+



select p.name, s.syori_date,  pd.name from sales s inner join person p on s.person_id = p.person_id inner join product pd on s.product_id =pd.product_id;

select c.name, s.syori_date, pd.name, p.name from sales s
  inner join customer c
    on s.customer_id = c.customer_id
  inner join product pd
    on s.product_id =pd.product_id
  inner join person p
    on s.person_id =p.person_id
  where
    s.customer_id = '1' And
    (s.syori_date >= '2006/05/01' And s.syori_date <= '2006/05/30');



# orderbyに指定した最初のカラムを優先的にソートする
#############################################################################################################
mysql> select * from person order by hurigana,person_id;
+-----------+-----------+--------------+--------+------------+------+
| person_id | name      | hurigana     | mgr_id | birthday   | sex  |
+-----------+-----------+--------------+--------+------------+------+
| 6         | 伊藤      | いとう       | 2      | 1972-04-01 | 0    |
| 8         | 宇賀神    | うがじん     | 1      | 1975-12-22 | 1    |
| 9         | 岡田      | おかだ       | 4      | 1972-03-18 | 1    |
| 2         | 小野      | おの         |        | 1960-08-02 | 1    |
| 5         | 小林      | こばやし     | 3      | 1971-02-11 | 0    |
| 3         | 斎藤      | さいとう     |        | 1963-10-15 | 1    |
| 7         | 佐瀬      | させ         | 2      | 1975-02-21 | 1    |
| 1         | 鈴木      | すずき       |        | 1960-01-23 | 1    |
| 4         | 藤本      | ふじもと     | 3      | 1972-07-18 | 1    |
+-----------+-----------+--------------+--------+------------+------+

mysql> select * from person order by person_id,hurigana;
+-----------+-----------+--------------+--------+------------+------+
| person_id | name      | hurigana     | mgr_id | birthday   | sex  |
+-----------+-----------+--------------+--------+------------+------+
| 1         | 鈴木      | すずき       |        | 1960-01-23 | 1    |
| 2         | 小野      | おの         |        | 1960-08-02 | 1    |
| 3         | 斎藤      | さいとう     |        | 1963-10-15 | 1    |
| 4         | 藤本      | ふじもと     | 3      | 1972-07-18 | 1    |
| 5         | 小林      | こばやし     | 3      | 1971-02-11 | 0    |
| 6         | 伊藤      | いとう       | 2      | 1972-04-01 | 0    |
| 7         | 佐瀬      | させ         | 2      | 1975-02-21 | 1    |
| 8         | 宇賀神    | うがじん     | 1      | 1975-12-22 | 1    |
| 9         | 岡田      | おかだ       | 4      | 1972-03-18 | 1    |
+-----------+-----------+--------------+--------+------------+------+
#############################################################################################################


# count時、特定のカラムを指定した際、そのカラムの値がNULLだとカウントされない
#############################################################################################################
mysql> select * from product where oroshi_price Is NULL;
+------------+-----------------------+--------------+-------------+--------------+
| product_id | name                  | grp_name     | siire_price | oroshi_price |
+------------+-----------------------+--------------+-------------+--------------+
| 6          | デジタルカメラ        | 周辺機器     |        NULL |         NULL |
+------------+-----------------------+--------------+-------------+--------------+

mysql> select count(*) from product;
+----------+
| count(*) |
+----------+
|       10 |
+----------+

mysql> select count(oroshi_price) from product;
+---------------------+
| count(oroshi_price) |
+---------------------+
|                   9 |
+---------------------+
#############################################################################################################


select p.name, sum(s.quantity) from sales s
inner join product p
on s.product_id = p.product_id
group by p.name
order by p.name;



# having句を指定する場合は、必ずグルーピングされていることが前提
#############################################################################################################
mysql> select p.name, sum(s.quantity) from sales s  inner join product p   on s.product_id = p.product_id   group by p.name order by p.name;
+-----------------------------------+-----------------+
| name                              | sum(s.quantity) |
+-----------------------------------+-----------------+
| 15型_液晶ディスプレイ             |               6 |
| 17型_ディスプレイ                 |               5 |
| 19型_ディスプレイ                 |               3 |
| HUB                               |               5 |
| スキャナ                          |               1 |
| ターミナルプラグ                  |               2 |
| デスクトップ型パソコン            |               6 |
| ノート型パソコン                  |               7 |
| プリンタ                          |               1 |
+-----------------------------------+-----------------+
#############################################################################################################


############################################################################################################################################
mysql> select product_id from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31';
+------------+
| product_id |
+------------+
| 1          |
| 4          |
| 1          |
| 1          |
| 2          |
| 7          |
| 8          |
+------------+

mysql> select distinct product_id from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31' group by product_id;
+------------+
| product_id |
+------------+
| 1          |
| 2          |
| 4          |
| 7          |
| 8          |
+------------+

mysql> select product_id from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31' group by product_id;
+------------+
| product_id |
+------------+
| 1          |
| 2          |
| 4          |
| 7          |
| 8          |
+------------+

mysql> select distinct product_id from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31';
+------------+
| product_id |
+------------+
| 1          |
| 4          |
| 2          |
| 7          |
| 8          |
+------------+
############################################################################################################################################


############################################################################################################################################
mysql> select product_id, count(product_id) from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31';
+------------+-------------------+
| product_id | count(product_id) |
+------------+-------------------+
| 1          |                 7 |
+------------+-------------------+

mysql> select distinct product_id, count(product_id) from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31' group by product_id;
+------------+-------------------+
| product_id | count(product_id) |
+------------+-------------------+
| 1          |                 3 |
| 2          |                 1 |
| 4          |                 1 |
| 7          |                 1 |
| 8          |                 1 |
+------------+-------------------+

mysql> select product_id, count(product_id) from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31' group by product_id;
+------------+-------------------+
| product_id | count(product_id) |
+------------+-------------------+
| 1          |                 3 |
| 2          |                 1 |
| 4          |                 1 |
| 7          |                 1 |
| 8          |                 1 |
+------------+-------------------+

mysql> select distinct product_id, count(product_id) from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31';
+------------+-------------------+
| product_id | count(product_id) |
+------------+-------------------+
| 1          |                 7 |
+------------+-------------------+
############################################################################################################################################


select date_format(syori_date,'%Y/%m'), count(distinct slip_no) from sales group by date_format(syori_date,'%Y/%m');

select name, oroshi_price from product where oroshi_price = (select max(oroshi_price) from product);

select product_id, name from product where product_id IN (select distinct product_id from sales where syori_date >= '2006/04/01' And syori_date <= '2006/04/31');


# 外部結合(片方の表しかないレコードも引っ張る)
############################################################################################################################################
mysql> select p.product_id, p.name, sum(s.quantity) from sales s left outer join product p on s.product_id = p.product_id group by s.product_id;
+------------+-----------------------------------+-----------------+
| product_id | name                              | sum(s.quantity) |
+------------+-----------------------------------+-----------------+
| 1          | デスクトップ型パソコン            |               6 |
| 10         | ターミナルプラグ                  |               2 |
| 2          | ノート型パソコン                  |               7 |
| NULL       | NULL                              |               1 |
| 3          | 17型_ディスプレイ                 |               5 |
| 4          | 19型_ディスプレイ                 |               3 |
| 5          | 15型_液晶ディスプレイ             |               6 |
| 7          | プリンタ                          |               1 |
| 8          | スキャナ                          |               1 |
| 9          | HUB                               |               5 |
+------------+-----------------------------------+-----------------+

mysql> select p.product_id, p.name, sum(s.quantity) from sales s right outer join product p on s.product_id = p.product_id group by s.product_id;
+------------+-----------------------------------+-----------------+
| product_id | name                              | sum(s.quantity) |
+------------+-----------------------------------+-----------------+
| 6          | デジタルカメラ                    |            NULL |
| 1          | デスクトップ型パソコン            |               6 |
| 10         | ターミナルプラグ                  |               2 |
| 2          | ノート型パソコン                  |               7 |
| 3          | 17型_ディスプレイ                 |               5 |
| 4          | 19型_ディスプレイ                 |               3 |
| 5          | 15型_液晶ディスプレイ             |               6 |
| 7          | プリンタ                          |               1 |
| 8          | スキャナ                          |               1 |
| 9          | HUB                               |               5 |
+------------+-----------------------------------+-----------------+
############################################################################################################################################

# 現在日付/時刻/タイムスタンプ
SELECT CURDATE();
SELECT CURTIME();
SELECT NOW();

# 日付計算 (INTERVALは文字列なので注意)
# select date_add(日付, INTERVAL 数値 タイプ);
# 例 ) 前日
select date_add(NOW(), INTERVAL -1 DAY);


# P50　問1
select p.name, sum(s.quantity) from sales s right outer join product p
on s.product_id = p.product_id And (s.syori_date >= '2006/04/01' And s.syori_date <= '2006/04/31')
group by p.name;

# ↓間違ったやつ　結合条件ではなく、where句に期間していしていた
select p.name, sum(s.quantity) from sales s right outer join product p
on s.product_id = p.product_id
where s.syori_date >= '2006/04/01' And s.syori_date <= '2006/04/31'
group by p.name;


# 問2
select date_format(s.syori_date,'%Y/%m'), c.name, (pr.oroshi_price * sum(s.quantity)) as total from sales s
right outer join customer c
  on s.customer_id = c.customer_id
right outer join product pr
  on s.product_id = pr.product_id
group by c.name,  date_format(s.syori_date,'%Y/%m')
having total >= 500000;


# 問3
select pr.name, sum(pr.oroshi_price * s.quantity) as total,
       sum(pr.oroshi_price * s.quantity) / (select sum(pr.oroshi_price * s.quantity) as total from sales s right outer join product pr on s.product_id = pr.product_id) * 100
from sales s
right outer join product pr
  on s.product_id = pr.product_id
group by s.product_id, pr.name;


# 含売レコードがある行を取得する
select * from person where exists (select * from sales where person.person_id = sales.person_id);



select name,
        case
          when sex = '0' then '女性'
          when sex = '1' then '男性'
          else NULL
        end as '性別'
from person;

